{
  "startNodeId": "q1",
  "nodes": {
    "q1": {
      "id": "q1",
      "text": "Is the client over 16?",
      "type": "question",
      "options": [
        { "label": "Yes", "nextNodeId": "q2" },
        { "label": "No", "nextNodeId": "q-safeguarding" }
      ]
    },
    "q-safeguarding": {
      "id": "q-safeguarding",
      "text": "Are there any safeguarding concerns in relation to the decisions being made about the client's care?",
      "type": "question",
      "options": [
        { "label": "Yes", "nextNodeId": "r-safeguarding" },
        { "label": "No", "nextNodeId": "r-under-16" }
      ]
    },
    "q2": {
      "id": "q2",
      "text": "Are there any concerns about the client's ability to retain, weigh, use and communicate information to make their own decision?",
      "type": "question",
      "options": [
        { "label": "Yes", "nextNodeId": "q3" },
        { "label": "No", "nextNodeId": "r-capacity-presumed" }
      ]
    },
    "q3": {
      "id": "q3",
      "text": "Has the client had an adequate programme of support to understand, retain, weigh and use the information relevant to the decision they need to make?",
      "type": "question",
      "options": [
        { "label": "Yes", "nextNodeId": "q4" },
        { "label": "No", "nextNodeId": "r-support-needed" }
      ]
    },
    "q4": {
      "id": "q4",
      "text": "Has the client undergone a formal capacity assessment?",
      "type": "question",
      "options": [
        { "label": "Yes", "nextNodeId": "q5" },
        { "label": "No", "nextNodeId": "r-assessment-needed" }
      ]
    },
    "q5": {
      "id": "q5",
      "text": "Was the client found to be lacking capacity to make the decision?",
      "type": "question",
      "options": [
        { "label": "Yes", "nextNodeId": "q10" },
        { "label": "No", "nextNodeId": "r-capacity-confirmed" }
      ]
    },
    "q6": {
      "id": "q6",
      "text": "Has a Best Interest Meeting been held?",
      "type": "question",
      "options": [
        { "label": "Yes", "nextNodeId": "q8" },
        { "label": "No", "nextNodeId": "r-hold-meeting" }
      ]
    },
    "q7": {
      "id": "q7",
      "text": "Have the client’s views, wishes and preferences been explored and appropriately considered in relation to this decision?",
      "type": "question",
      "options": [
        { "label": "Yes", "nextNodeId": "q6" },
        { "label": "No", "nextNodeId": "r-seek-views" }
      ]
    },
    "q8": {
      "id": "q8",
      "text": "As a result of the best interest decision, could the client be considered to be under continuous supervision and control and unable to freely leave their home?",
      "type": "question",
      "options": [
        { "label": "Yes", "nextNodeId": "r-dol-warning" },
        { "label": "No", "nextNodeId": "q9" }
      ]
    },
    "q9": {
      "id": "q9",
      "text": "Is the decision or act made in the client's best interest the least restrictive option?",
      "type": "question",
      "options": [
        { "label": "Yes", "nextNodeId": "q-review-date" },
        { "label": "No", "nextNodeId": "r-consider-alternatives" }
      ]
    },
    "q10": {
      "id": "q10",
      "text": "Is the client expected to gain/regain capacity?",
      "type": "question",
      "options": [
        { "label": "Yes", "nextNodeId": "r-delay-decision" },
        { "label": "No", "nextNodeId": "q7" }
      ]
    },
    "q-review-date": {
      "id": "q-review-date",
      "text": "Is a date in the diary to review the best interest decision?",
      "type": "question",
      "options": [
        { "label": "Yes", "nextNodeId": "r-process-complete" },
        { "label": "No", "nextNodeId": "r-schedule-review" }
      ]
    },
    "r-under-16": {
      "id": "r-under-16",
      "text": "Outcome: Parental Responsibility",
      "details": "In most circumstances, for children under 16 years of age, parents or those with parental responsibility are legally responsible for making decisions concerning their child's care, treatment and general welfare, ensuring that all decisions are made in the child's best interests.",
      "type": "result",
      "status": "incapacity"
    },
    "r-safeguarding": {
      "id": "r-safeguarding",
      "text": "Action: Safeguarding Response",
      "details": "Where safeguarding concerns are identified, there is a legal duty to act in accordance with relevant safeguarding legislation, professionals must respond appropriately to protect the client from harm.\n\nYou should seek guidance from your designated safeguarding lead or access external safeguarding supervision to determine the most appropriate next steps.",
      "type": "result",
      "status": "incapacity"
    },
    "r-capacity-presumed": {
      "id": "r-capacity-presumed",
      "text": "Outcome: Capacity Assumed",
      "details": "The presumption of capacity applies. This means that the client is assumed to have the ability to make their own decision.",
      "type": "result",
      "status": "capacity"
    },
    "r-support-needed": {
      "id": "r-support-needed",
      "text": "Action Required: Provide Support",
      "details": "Section 1 of the Mental Capacity Act (2005) states that a person is not to be treated as unable to make a decision unless all practicable steps to help them to do so have been taken without success.\n\nThis client requires a programme of capacity building support to help them retain, weigh and use the relevant information to make the decision.",
      "type": "result",
      "status": "incapacity"
    },
    "r-assessment-needed": {
      "id": "r-assessment-needed",
      "text": "Action Required: Formal Assessment",
      "details": "Section 1 of the Mental Capacity Act (2005) states that a person must be assumed to have capacity unless it is established that they lack capacity.\n\nThis client requires a decision specific formal capacity assessment.",
      "type": "result",
      "status": "incapacity"
    },
    "r-capacity-confirmed": {
      "id": "r-capacity-confirmed",
      "text": "Outcome: Capacity Confirmed",
      "details": "Section 1 of the Mental Capacity Act (2005) states that a person must be assumed to have capacity unless it is established that they lack capacity.\n\nThe client is assumed to have the ability to make their own decision.",
      "type": "result",
      "status": "capacity"
    },
    "r-delay-decision": {
      "id": "r-delay-decision",
      "text": "Action: Delay Decision & Reassess",
      "details": "In accordance with Section 4 of the Mental Capacity Act (2005), consideration must be given to whether the client may regain capacity and, if so, whether the decision can reasonably be delayed until such time that they are able to participate fully in the decision-making process.\n\nPrioritise the client's future ability to decide for themselves. Consider if the decision can be safely delayed until capacity returns. Avoid making permanent decisions unnecessarily. Consider reassessing capacity at an appropriate time.",
      "type": "result",
      "status": "incapacity"
    },
    "r-hold-meeting": {
      "id": "r-hold-meeting",
      "text": "Action: Hold Best Interest Meeting",
      "details": "Section 1 of the Mental Capacity Act (2005) states that any act or decision made on behalf of a person who lacks capacity must be done, or made, in their best interests.\n\nIn order to ascertain the most appropriate next steps, a best interest meeting should be held, to include the views of all people concerned with the client's care and welfare including professionals and legal deputy.",
      "type": "result",
      "status": "incapacity"
    },
    "r-seek-views": {
      "id": "r-seek-views",
      "text": "Action: Seek Client's Views",
      "details": "In accordance with Section 4 of the Mental Capacity Act (2005), those making best interest decisions should permit and encourage the client to participate, or to improve their ability to participate, as fully as possible in any act done for them and any decision affecting them.\n\nThe views of the client should be sought and adequately considered.",
      "type": "result",
      "status": "incapacity"
    },
    "r-dol-warning": {
      "id": "r-dol-warning",
      "text": "Outcome: Deprivation of Liberty",
      "details": "Under the Deprivation of Liberty Safeguards (DoLS) framework this decision may amount to a Deprivation of Liberty and may require appropriate application to and authorisation from the Court of Protection.",
      "type": "result",
      "status": "incapacity"
    },
    "r-consider-alternatives": {
      "id": "r-consider-alternatives",
      "text": "Action: Consider Less Restrictive Options",
      "details": "Section 4 of the Mental Capacity Act (2005) states that before the act is done, or the decision is made, regard must be had to whether the purpose for which it is needed can be as effectively achieved in a way that is less restrictive of the client's rights and freedom of action.\n\nAll possible alternatives should be actively considered. Where an alternative remains unsuitable there should be clear evidence to support this and justification should be well documented.",
      "type": "result",
      "status": "incapacity"
    },
    "r-schedule-review": {
      "id": "r-schedule-review",
      "text": "Action: Schedule Review",
      "details": "The Mental Capacity Act Code of practice (2013) makes clear that decisions are kept under regular review and reconsidered where circumstances change, where capacity may fluctuate, or where new information becomes available, to ensure the decision remains appropriate, proportionate and in the Client's best interests.\n\nAll decisions, support and actions taken in the client's best interests must be routinely reviewed. Schedule dates in the diary to ensure this happens.",
      "type": "result",
      "status": "capacity"
    },
    "r-process-complete": {
      "id": "r-process-complete",
      "text": "Process Complete",
      "details": "The Mental Capacity Act Code of Practice makes clear that individuals involved in the client's care and welfare should continue to remain alert to any changes in the client's presentation, circumstances, capacity or needs, and ensure that decision-making continues to reflect current best interests.",
      "type": "result",
      "status": "capacity"
    }
  }
}